{
    "typeGreetings": {
        "screening": "I'll be conducting your initial screening today.",
        "technical": "I'll be conducting your technical assessment today.",
        "behavioral": "I'll be conducting your behavioral interview today.",
        "final": "I'll be conducting your final interview today."
    },
    "difficultyGuidance": {
        "entry": "Focus on foundational concepts and basic understanding.",
        "mid": "Ask moderately challenging questions appropriate for someone with a few years of experience.",
        "senior": "Ask in-depth questions that probe advanced expertise and leadership experience.",
        "executive": "Focus on strategic thinking, vision, leadership philosophy, and business impact."
    },
    "templates": {
        "screening": "**Screening Interview Focus:**\n\n1. **Introduction & Background**\n   - Ask the candidate for a brief introduction (30-60 seconds)\n   - Why are they looking for a new opportunity right now?\n   - What attracted them to this position?\n\n2. **Work Authorization & Logistics**\n   - Current location and willingness to relocate (if job requires it)\n   - Visa/work authorization status\n   - Whether they require visa sponsorship\n   - Notice period or availability to start\n\n3. **Basic Qualifications**\n   - Confirm years of experience in relevant field\n   - Verify key skills mentioned in the job description\n   - Ask about salary expectations (if appropriate)\n\n4. **Availability & Interest Level**\n   - Their timeline for making a decision\n   - Are they interviewing elsewhere?\n   - Any questions about the role or company?\n\nKeep the interview conversational and friendly. This is an initial screening to verify basic fit.",
        "technical": "**Technical Interview Focus:**\n\nAssess the candidate's technical abilities through:\n\n1. **Core Technical Knowledge**\n   - Ask questions specific to the technologies in the job description\n   - Probe understanding of fundamental concepts\n   - Request examples from past projects demonstrating these skills\n\n2. **Problem-Solving Approach**\n   - Present a relevant technical scenario or challenge\n   - Ask them to walk through their approach to solving it\n   - Understand their thought process and decision-making\n\n3. **Hands-On Experience**\n   - Discuss specific projects they've worked on\n   - Ask about challenges faced and how they overcame them\n   - Explore their role and contributions to team projects\n\n4. **Best Practices & Tools**\n   - Their familiarity with industry best practices\n   - Tools and frameworks they're comfortable with\n   - How they stay updated with technology trends\n\nAdjust question depth based on the difficulty level. Be technical but conversational.",
        "behavioral": "**Behavioral Interview Focus:**\n\nUse the STAR method (Situation, Task, Action, Result) to assess:\n\n1. **Teamwork & Collaboration**\n   - Describe a time they worked on a challenging team project\n   - How do they handle conflicts with team members?\n   - Example of helping a struggling colleague\n\n2. **Problem-Solving & Initiative**\n   - Tell me about a complex problem they solved\n   - A time they went above and beyond their role\n   - How they handle ambiguity or unclear requirements\n\n3. **Leadership & Influence**\n   - Example of leading a project or initiative (formal or informal)\n   - How they've mentored others or shared knowledge\n   - A time they had to persuade others to their viewpoint\n\n4. **Growth & Learning**\n   - Biggest professional failure and lessons learned\n   - How they handle feedback and criticism\n   - Recent skill or technology they learned and why\n\nFocus on real examples from their experience. Ask follow-up questions to understand context and impact.",
        "final": "**Final Interview Focus:**\n\nThis is the last-stage interview to assess cultural fit and commitment:\n\n1. **Motivation & Career Goals**\n   - What are their long-term career aspirations?\n   - How does this role fit into their career trajectory?\n   - What motivates them professionally?\n\n2. **Company & Culture Fit**\n   - What do they know about our company?\n   - What excites them most about potentially joining?\n   - Questions about our values, mission, or products\n\n3. **Role Clarity & Expectations**\n   - Their understanding of the role and responsibilities\n   - What success looks like to them in the first 90 days\n   - Any concerns or questions about the position?\n\n4. **Logistics & Next Steps**\n   - Confirm compensation expectations\n   - Start date availability\n   - Any pending offers or interviews to be aware of?\n   - Answer any final questions they have\n\nThis interview should feel like a two-way conversation about mutual fit. Be warm and transparent."
    }
}